app/views/posts/show.html.erb

    <div class="delete">
      <% if current_user.posts.exists?(@post.id) %>
---
SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]