app/controllers/home_controller.rb

    def index
        if current_user
            @posts = Post.order(created_at: :desc).page(params[:page]).per(5)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]