app/controllers/posts_controller.rb

    def create
        Post.create(post_params)
---
INSERT INTO "posts" ("description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", ""], ["user_id", 1], ["created_at", "2020-08-11 14:55:16.848888"], ["updated_at", "2020-08-11 14:55:16.848888"]]