app/controllers/search_controller.rb

    def index
        if params[:query].start_with?('#')
            query  = params[:query].gsub('#', '')
            @posts = Post.joins(:hash_tags).where(hash_tags: {name: query})
            else
            @posts = Post.where("description like ?", "%#{params[:query]}%")
---
SELECT "posts".* FROM "posts" WHERE (description like '%description%')