app/controllers/users_controller.rb

    def show
        @user  = User.find(params[:id])
        @posts = @user.posts.order(created_at: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]

    def update
        current_user.update(user_params)
---
UPDATE "users" SET "username" = $1, "name" = $2, "website" = $3, "bio" = $4, "phone" = $5, "gender" = $6, "updated_at" = $7 WHERE "users"."id" = $8  [["username", "jackjack"], ["name", "jack"], ["website", "ajsjsa"], ["bio", "Awesome"], ["phone", 22929], ["gender", "male"], ["updated_at", "2020-08-09 20:24:07.705610"], ["id", 1]]